{
  "backend/main.mo": "Main Motoko actor implementing a portfolio website backend with authorization, blob storage, and CRUD operations for achievements, blog posts, contact forms, content sections, and various settings (CMS, UI, AI). Includes Salesforce integration for contact forms and digital marketing data tracking.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (home page, achievements, contact form, blog section) to their corresponding frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of key frontend files including App.tsx (router setup), BlogPage.tsx (blog listing), EditIntroduction.tsx (admin intro editor), ContactSubmissions.tsx (admin contact viewer), and CMSSettings.tsx (CMS configuration).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, accent, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point for the React application with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for public pages (home, blog, contact) and admin pages (dashboard, introduction, achievements, blog management, AI settings, custom sections, contacts, CMS settings), plus theme provider, chat widget, and toast notifications.",
  "frontend/src/components/AchievementForm.tsx": "React form component for adding or editing achievements with fields for title, description, date, and image upload with preview and progress tracking, using mutations from useQueries hook.",
  "frontend/src/components/AchievementsSection.tsx": "React component displaying achievements in a responsive grid layout with cards showing images, titles, dates, and descriptions, including loading skeletons and animations.",
  "frontend/src/components/BlogPostForm.tsx": "Form component for creating and editing blog posts with title, content, publication date, and featured image upload with progress tracking. Handles both add and update mutations with toast notifications.",
  "frontend/src/components/ChatWidget.tsx": "Floating chat widget component with expandable interface that displays AI assistant messages, handles user input, and shows a greeting popup for first-time visitors. Currently simulates bot responses with placeholder for Salesforce Agentforce integration.",
  "frontend/src/components/ContactForm.tsx": "Contact form component that collects name, email, and message from users and submits to backend with timestamp. Displays success/error toasts and clears form on successful submission.",
  "frontend/src/components/CustomSectionForm.tsx": "Form component for creating and editing custom content sections with title, content text, and optional image upload. Supports both add and update operations with upload progress tracking.",
  "frontend/src/components/CustomSectionsDisplay.tsx": "Display component that renders all custom content sections in card format with optional images, titles, and formatted content paragraphs. Includes staggered animation delays for visual effect.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column layout displaying portfolio description, quick navigation links, social media icons (GitHub, LinkedIn, X), and copyright notice with caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with full-width background image, gradient overlay, centered title/subtitle text, and animated decorative elements. Features bounce animation on arrow-down icon.",
  "frontend/src/components/IntroductionDisplay.tsx": "Two-column introduction section displaying profile image and bio information (name, title, bio text) with loading skeleton states. Uses animated entrance effects for visual polish.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with Navigation header, main content outlet, and Footer. Provides consistent structure across the application.",
  "frontend/src/components/Navigation.tsx": "Navigation component with responsive mobile/desktop menus, authentication controls (login/logout), and dynamic admin link visibility based on user role.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on portfolio content (introduction, achievements, blog posts, contact forms, CMS settings, AI settings, and site stats).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color system for light/dark themes, gradient utilities, and keyframe animations (float, slideUp, fadeIn, scaleIn).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing site statistics (messages, achievements, blog posts, contacts) and navigation cards to various admin management pages. Includes admin access check.",
  "frontend/src/pages/admin/CMSSettings.tsx": "Admin page for configuring CMS settings including theme, layout options, and custom section ordering. Form updates settings via mutation hook.",
  "frontend/src/pages/admin/ContactSubmissions.tsx": "Displays all contact form submissions with name, email, message, timestamp, and Salesforce sync status. Shows empty state if no submissions exist.",
  "frontend/src/pages/admin/EditAISettings.tsx": "Admin form for configuring AI chatbot settings including bot name, initial greeting, avatar image upload with preview, and Salesforce API key integration.",
  "frontend/src/pages/admin/EditIntroduction.tsx": "Admin page for editing the introduction section with form fields for name, title, bio, and profile image upload with preview. Handles image file uploads using ExternalBlob with progress tracking and updates via mutation.",
  "frontend/src/pages/admin/ManageAchievements.tsx": "Admin page for managing achievements with list view, add/edit/delete functionality, and confirmation dialogs. Displays achievement cards with images, titles, dates, and descriptions.",
  "frontend/src/pages/admin/ManageBlogPosts.tsx": "Admin page for managing blog posts with CRUD operations, displaying posts in cards with featured images, excerpts, and publication dates. Includes form modal for creating/editing posts and delete confirmation dialog.",
  "frontend/src/pages/admin/ManageCustomSections.tsx": "Admin page for managing custom content sections with add/edit/delete capabilities. Shows sections in cards with optional images, titles, and content excerpts.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page displaying posts in a responsive grid with featured images, publication dates, excerpts, and navigation to individual post pages.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with title, date, featured image, and content. Fetches post by ID from URL params and shows loading skeleton or 404 if not found.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying contact information (email, phone, location) alongside a ContactForm component. Uses grid layout with icons and animations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes HeroSection, IntroductionDisplay, AchievementsSection, and CustomSectionsDisplay components in sequence.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing. Includes sessionStorage persistence helpers and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom border radii, glow shadows, font families (Inter, JetBrains Mono), and animation keyframes for accordions and slides.",
  "project_state.json": "Project state document defining a Salesforce Senior Engineer portfolio website with features including dynamic introduction section, achievements showcase, contact form with Salesforce CRM integration, blog capability, and Agentforce AI chatbot positioned bottom-right with greeting animation."
}